Masmiseim36/nxpSDK/devices/MKE16Z4/utilities/fsl_shell.c
                /* Special key */
                if (ch == KEY_ESC)
                {
                    shellContextHandle->stat = kSHELL_Special;
                    continue;
                }
                else if (shellContextHandle->stat == kSHELL_Special)
                {
                    /* Function key */
                    if (ch == '[')
                    {
                        shellContextHandle->stat = kSHELL_Function;
                        continue;
                    }
                    shellContextHandle->stat = kSHELL_Normal;
                }
                else if (shellContextHandle->stat == kSHELL_Function)
                {
                    shellContextHandle->stat = kSHELL_Normal;

                    switch ((uint8_t)ch)
                    {
                        /* History operation here */
                        case 'A': /* Up key */
                            SHELL_GetHistoryCommand(shellContextHandle, shellContextHandle->hist_current);
                            if (shellContextHandle->hist_current < (shellContextHandle->hist_count - 1))
                            {
                                shellContextHandle->hist_current++;
                            }
                            break;
                        case 'B': /* Down key */
                            SHELL_GetHistoryCommand(shellContextHandle, shellContextHandle->hist_current);
                            if (shellContextHandle->hist_current > 0)
                            {
                                shellContextHandle->hist_current--;
                            }
                            break;
                        case 'D': /* Left key */
                            if (shellContextHandle->c_pos)
                            {
                                SHELL_Write(shellContextHandle, "\b", 1);
                                shellContextHandle->c_pos--;
                            }
                            break;
                        case 'C': /* Right key */
                            if (shellContextHandle->c_pos < shellContextHandle->l_pos)
                            {
                                SHELL_Write(shellContextHandle, &shellContextHandle->line[shellContextHandle->c_pos],
                                            1);
                                shellContextHandle->c_pos++;
                            }
                            break;
                        default:
                            break;
                    }
                    continue;
                }
                /* Handle tab key */
                else if (ch == '\t')
                {
#if SHELL_AUTO_COMPLETE
                    /* Move the cursor to the beginning of line */
                    for (int i = 0; i < shellContextHandle->c_pos; i++)
                    {
                        SHELL_Write(shellContextHandle, "\b", 1);
                    }
                    /* Do auto complete */
                    SHELL_AutoComplete(shellContextHandle);
                    /* Move position to end */
                    shellContextHandle->c_pos = shellContextHandle->l_pos = strlen(shellContextHandle->line);
#endif
                    continue;
                }
                /* Handle backspace key */
                else if ((ch == KET_DEL) || (ch == '\b'))
                {
                    /* There must be at last one char */
                    if (shellContextHandle->c_pos == 0)
                    {
                        continue;
                    }

                    shellContextHandle->l_pos--;
                    shellContextHandle->c_pos--;

                    if (shellContextHandle->l_pos > shellContextHandle->c_pos)
                    {
                        memmove(&shellContextHandle->line[shellContextHandle->c_pos],
                                &shellContextHandle->line[shellContextHandle->c_pos + 1],
                                shellContextHandle->l_pos - shellContextHandle->c_pos);
                        shellContextHandle->line[shellContextHandle->l_pos] = 0;
                        SHELL_Write(shellContextHandle, "\b", 1);
                        SHELL_Write(shellContextHandle, &shellContextHandle->line[shellContextHandle->c_pos],
                                    strlen(&shellContextHandle->line[shellContextHandle->c_pos]));
                        SHELL_Write(shellContextHandle, "  \b", 3);

                        /* Reset position */
                        for (int i = shellContextHandle->c_pos; i <= shellContextHandle->l_pos; i++)
                        {
                            SHELL_Write(shellContextHandle, "\b", 1);
                        }
                    }
                    else /* Normal backspace operation */
                    {
                        SHELL_Write(shellContextHandle, "\b \b", 3);
                        shellContextHandle->line[shellContextHandle->l_pos] = 0;
                    }
                    continue;
                }
                else
                {
                }

                /* Input too long */
                if (shellContextHandle->l_pos >= (SHELL_BUFFER_SIZE - 1))
                {
                    shellContextHandle->l_pos = 0;
                }

                /* Handle end of line, break */
                if ((ch == '\r') || (ch == '\n'))
                {
                    static char endoflinechar = 0U;

                    if ((endoflinechar != 0U) && (endoflinechar != ch))
                    {
                        continue;
                    }
                    else
                    {
                        endoflinechar = ch;
                        SHELL_Write(shellContextHandle, "\r\n", 2);
                        /* If command line is NULL, will start a new transfer */
                        if (0U == strlen(shellContextHandle->line))
                        {
                            SHELL_Write(shellContextHandle, shellContextHandle->prompt,
                                        strlen(shellContextHandle->prompt));
                            continue;
                        }
                        SHELL_ProcessCommand(shellContextHandle, shellContextHandle->line);
                        /* Reset all params */
                        shellContextHandle->c_pos = shellContextHandle->l_pos = 0;
                        shellContextHandle->hist_current = 0;
                        SHELL_Write(shellContextHandle, shellContextHandle->prompt, strlen(shellContextHandle->prompt));
                        memset(shellContextHandle->line, 0, sizeof(shellContextHandle->line));
                        continue;
                    }
                }

