Masmiseim36/nxpSDK/devices/MKE16Z4/utilities/fsl_shell.c
static int32_t SHELL_StringCompare(const char *str1, const char *str2, int32_t count)
{
    while (count--)
    {
        if (*str1++ != *str2++)
        {
            return *(unsigned char *)(str1 - 1) - *(unsigned char *)(str2 - 1);
        }
    }
    return 0;
}

static int32_t SHELL_ParseLine(const char *cmd, uint32_t len, char *argv[])
{
    uint32_t argc;
    char *p;
    uint32_t position;

    /* Init params */
    memset(s_paramBuffer, '\0', len + 1);
    memcpy(s_paramBuffer, cmd, len);

    p = s_paramBuffer;
    position = 0;
    argc = 0;

    while (position < len)
    {
        /* Skip all blanks */
        while (((char)(*p) == ' ') && (position < len))
        {
            *p = '\0';
            p++;
            position++;
        }
        /* Process begin of a string */
        if (*p == '"')
        {
            p++;
            position++;
            argv[argc] = p;
            argc++;
            /* Skip this string */
            while ((*p != '"') && (position < len))
            {
                p++;
                position++;
            }
            /* Skip '"' */
            *p = '\0';
            p++;
            position++;
        }
        else /* Normal char */
        {
            argv[argc] = p;
            argc++;
            while (((char)*p != ' ') && ((char)*p != '\t') && (position < len))
            {
                p++;
                position++;
            }
        }
    }
    return argc;
}

static shell_status_t SHELL_GetChar(shell_context_handle_t *shellContextHandle, uint8_t *ch)
{
#if (defined(SHELL_NON_BLOCKING_MODE) && (SHELL_NON_BLOCKING_MODE > 0U))
    uint32_t length;

    if (kStatus_SerialManager_Success == SerialManager_TryRead(shellContextHandle->serialReadHandle, ch, 1, &length))
    {
        if (length > 0)
        {
            return kStatus_SHELL_Success;
        }
    }

    return kStatus_SHELL_Error;
#else
    return (shell_status_t)SerialManager_ReadBlocking(shellContextHandle->serialReadHandle, ch, 1);
#endif
}

shell_status_t SHELL_Init(shell_handle_t shellHandle, serial_handle_t serialHandle, char *prompt)
{
    shell_context_handle_t *shellContextHandle;
    assert(shellHandle);
    assert(serialHandle);
    assert(prompt);

    if (SHELL_HANDLE_SIZE < sizeof(shell_context_handle_t))
    {
        return kStatus_SHELL_Error;
    }

    shellContextHandle = (shell_context_handle_t *)shellHandle;

    /* memory set for shellHandle */
    memset(shellHandle, 0, SHELL_HANDLE_SIZE);

#if (defined(SHELL_NON_BLOCKING_MODE) && (SHELL_NON_BLOCKING_MODE > 0U))

#if defined(OSA_USED)

#if (defined(SHELL_USE_COMMON_TASK) && (SHELL_USE_COMMON_TASK > 0U))
    COMMON_TASK_init();
#else
    if (KOSA_StatusSuccess != OSA_EventCreate((osa_event_handle_t)shellContextHandle->event, true))
    {
        return kStatus_SHELL_Error;
    }

    if (KOSA_StatusSuccess !=
        OSA_TaskCreate((osa_task_handle_t)shellContextHandle->taskId, OSA_TASK(SHELL_Task), shellContextHandle))
    {
        return kStatus_SHELL_Error;
    }
#endif

#endif

#endif

    shellContextHandle->prompt = prompt;
    shellContextHandle->serialHandle = serialHandle;

    shellContextHandle->serialWriteHandle = (serial_write_handle_t)&shellContextHandle->serialWriteHandleBuffer[0];
    if (kStatus_SerialManager_Success !=
        SerialManager_OpenWriteHandle(shellContextHandle->serialHandle, shellContextHandle->serialWriteHandle))
    {
        return kStatus_SHELL_OpenWriteHandleFailed;
    }
    else
    {
#if (defined(SHELL_NON_BLOCKING_MODE) && (SHELL_NON_BLOCKING_MODE > 0U))
        SerialManager_InstallTxCallback(shellContextHandle->serialWriteHandle, SHELL_SerialManagerTxCallback,
                                        shellContextHandle);
#endif
    }

    shellContextHandle->serialReadHandle = (serial_read_handle_t)&shellContextHandle->serialReadHandleBuffer[0];
    if (kStatus_SerialManager_Success !=
        SerialManager_OpenReadHandle(shellContextHandle->serialHandle, shellContextHandle->serialReadHandle))
    {
        return kStatus_SHELL_OpenReadHandleFailed;
    }
    else
    {
#if (defined(SHELL_NON_BLOCKING_MODE) && (SHELL_NON_BLOCKING_MODE > 0U))
        SerialManager_InstallRxCallback(shellContextHandle->serialReadHandle, SHELL_SerialManagerRxCallback,
                                        shellContextHandle);
#endif
    }

    SHELL_RegisterCommand(shellContextHandle, SHELL_COMMAND(help));
    SHELL_RegisterCommand(shellContextHandle, SHELL_COMMAND(exit));

    SHELL_Write(shellContextHandle, "\r\nSHELL build: ", strlen("\r\nSHELL build: "));
    SHELL_Write(shellContextHandle, __DATE__, strlen(__DATE__));
    SHELL_Write(shellContextHandle, "\r\nCopyright (c) 2018 NXP Semiconductor\r\n",
                strlen("\r\nCopyright (c) 2018 NXP Semiconductor\r\n"));
    SHELL_Write(shellContextHandle, shellContextHandle->prompt, strlen(shellContextHandle->prompt));

    return kStatus_SHELL_Success;
}

shell_status_t SHELL_RegisterCommand(shell_handle_t shellHandle, shell_command_t *command)
{
    shell_context_handle_t *shellContextHandle = (shell_context_handle_t *)shellHandle;
    assert(shellHandle);
    assert(command);

    /* memory set for shellHandle */
    memset(&command->link, 0, sizeof(command->link));

    LIST_AddTail(&shellContextHandle->commandContextListHead, &command->link);

    return kStatus_SHELL_Success;
}

shell_status_t SHELL_UnregisterCommand(shell_command_t *command)
{
    assert(command);

    LIST_RemoveElement(&command->link);

    /* memory set for shellHandle */
    memset(&command->link, 0, sizeof(command->link));

    return kStatus_SHELL_Success;
}

shell_status_t SHELL_Write(shell_handle_t shellHandle, char *buffer, uint32_t length)
{
    shell_context_handle_t *shellContextHandle;
    uint32_t primask;

    assert(shellHandle);
    assert(buffer);
    assert(length);

    shellContextHandle = (shell_context_handle_t *)shellHandle;

    primask = DisableGlobalIRQ();
    if (shellContextHandle->printBusy)
    {
        EnableGlobalIRQ(primask);
        return kStatus_SHELL_Error;
    }
    shellContextHandle->printBusy = 1U;
    EnableGlobalIRQ(primask);

    if (kStatus_SerialManager_Success ==
        SerialManager_WriteBlocking(shellContextHandle->serialWriteHandle, (uint8_t *)buffer, length))
    {
        shellContextHandle->printBusy = 0U;
        return kStatus_SHELL_Success;
    }
    shellContextHandle->printBusy = 0U;

    return kStatus_SHELL_Error;
}

int SHELL_Printf(shell_handle_t shellHandle, const char *formatString, ...)
{
    shell_context_handle_t *shellContextHandle;
    uint32_t length;
    uint32_t primask;
    va_list ap;

    assert(shellHandle);
    assert(formatString);

    shellContextHandle = (shell_context_handle_t *)shellHandle;

    primask = DisableGlobalIRQ();
    if (shellContextHandle->printBusy)
    {
        EnableGlobalIRQ(primask);
        return -1;
    }
    shellContextHandle->printBusy = 1U;
    EnableGlobalIRQ(primask);

    va_start(ap, formatString);

    shellContextHandle->printLength = 0U;
    length = SHELL_Sprintf(shellHandle, formatString, ap);
    SerialManager_WriteBlocking(shellContextHandle->serialWriteHandle, (uint8_t *)shellContextHandle->printBuffer,
                                length);
    va_end(ap);

    shellContextHandle->printBusy = 0U;
    return shellContextHandle->printLength;
}
